books_app/app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "memo", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Ruby超入門"], ["memo", "unko"], ["created_at", "2021-11-15 11:38:31.062935"], ["updated_at", "2021-11-15 11:38:31.062935"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "title" = ?, "memo" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "夜の夜の夜"], ["memo", "stars on sky"], ["updated_at", "2021-11-16 16:21:58.292880"], ["id", 2]]